anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
#include "APP/APP.h"
#ifdef APP
#if (APP==APP10_DEMO1)
/*
 * File Name: Time_DateApp.c
 * Layer	: App
 * Version  : V 0.0
 * Created	:  Apr 8, 2024
 * Author1 	: Yasmin Amr
 * Author2  : Anas Khamees
 */

/**********************************************************************************/
/*										Includes				     			  */
/**********************************************************************************/
#include "MCAL/UART/USART.h"
#include "MCAL/GPIO/GPIO.h"
#include "MCAL/NVIC/NVIC.h"
#include "MCAL/NVIC/STM32F401xx.h"
#include "MCAL/UART/USART.h"
#include "HAL/PeripheralCLK_Control/CLK_Control.h"
#include "HAL/LCD_Scheduler/LCD.h"
#include "Scheduler/Scheduler.h"

/***********************************************************************************/
/*										Defines									   */
/***********************************************************************************/

#define OK                          '3'
#define START_STOP_STOPWATCH        '5'
#define RESET_STOPWATCH             '6'
#define PAUSE_CONTINUE_STOPWATCH    '7'
#define UP                          '2'
#define DOWN                        '7'
#define RIGHT                       '8'
#define LEFT                        '6'
#define EDIT                        '4'
#define MODE                        '1'

#define MainMenu    0
#define StopWatch   1
#define DateTime    2

#define FirstLine   0
#define SecondLine  1

#define ON                           1
#define OFF                          0

#define CONSTANT                    0
#define MODIFIED                    1

#define DATE_TIME_INDEX 6

#define HOURS_INDEX1    6    
#define HOURS_INDEX2    7
#define MINUTES_INDEX1  9
#define MINUTES_INDEX2  10
#define SECONDS_INDEX1  12
#define SECONDS_INDEX2  13

#define DAY_INDEX1      6
#define DAY_INDEX2      7
#define MONTH_INDEX1    9
#define MONTH_INDEX2    10
#define YEAR_INDEX1     12
#define YEAR_INDEX2     13
#define YEAR_INDEX3     14
#define YEAR_INDEX4     15


#define STOP_WATCH_PAUSE            0
#define STOP_WATCH_CONTINUE         1
#define STOP_WATCH_RESET_ON         2
#define STOP_WATCH_RESET_OFF        3
#define STOP_WATCH_START            4
#define STOP_WATCH_STOP             5
/***********************************************************************************/
/*										Types									   */
/***********************************************************************************/



/************************************************************************************/
/*									Variables									    */
/************************************************************************************/
uint8_t buffer=0;
uint8_t CurrentMode= MainMenu;
uint8_t MM_CursorLoc=FirstLine;

uint8_t Day=10;
uint8_t Month=4;
uint16_t Year=2024;

uint8_t DayLength=1;
uint8_t MonthLength=1;

uint8_t DateTimePosCounter=0;


uint8_t CurrentDisplay=StopWatch;

uint8_t EditMode=OFF;

uint8_t PosX=FirstLine;
uint8_t PosY=DATE_TIME_INDEX;

uint8_t ModeState=CONSTANT;

uint8_t EditUpdate=CONSTANT;


/************************************************************************************/
/*                              Time Variables                                      */
/************************************************************************************/

uint32_t TimeSeconds=30;
uint32_t TimeMinutes=59;
uint32_t TimeHours=0;

/************************************************************************************/
/*                              Stop Watch Variables                                */
/************************************************************************************/
uint8_t StopWatchTensSeconds=0;
uint8_t StopWatchSeconds=0;
uint8_t StopWatchMinutes=0;
uint8_t StopWatchHours=0;

uint8_t StopWatchStartStop=STOP_WATCH_STOP;
uint8_t StopWatchPauseContinue=STOP_WATCH_CONTINUE;
uint8_t StopWatchReset=STOP_WATCH_RESET_OFF;

/*************************************************************************************/
/*							Static Functions Prototype								 */
/*************************************************************************************/
 static void LCD_ShiftRight(void);
 static void LCD_ShiftLeft(void);
 static void LCD_DisplayMainMenu(void);
 static void LCD_IncrementDateTime(void);
 static void LCD_DecrementDateTime(void);
 static void USART_ReceiveCbf(void);

/************************************************************************************/
/*                            APIs Implementation								    */
/************************************************************************************/
static void LCD_ShiftRight(void)
{
    /* If the Cursor now,In the most Right of First Line and ShiftRight is Triggered, 
     * The cursor will move to the most Right in the Second Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
     if(PosY==SECONDS_INDEX2&&PosX==FirstLine)
    {
        PosX=SecondLine;
        PosY=YEAR_INDEX4; /* Anas Edit this */
    }
    /* If the Cursor now,In the most Right of SecondLine and ShiftRight is Triggered, 
     * The cursor will move to the most Right in the First Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
    else if(PosY==YEAR_INDEX4&&PosX==SecondLine)
    {
        PosX=FirstLine;
        PosY=SECONDS_INDEX2;  /* Anas Edit this */
    }
    else
    {
        PosY++;
    }
    LCD_SetCursorPosAsynch(LCD1,PosX,PosY,NULL);
}

static void LCD_ShiftLeft(void)
{
    /* If the Cursor now,In the most Left of First Line and ShiftLeft is Triggered, 
     * The cursor will move to the most Left in the Second Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
    if(PosY==HOURS_INDEX1&&PosX==FirstLine)
    {
        PosX=SecondLine;
        PosY=DAY_INDEX1; /* Anas Edit This */
    }
    /* If the Cursor now,In the most Left of Second Line and ShiftLeft is Triggered, 
     * The cursor will move to the most Left in the First Line.
     * For Ease and flexibility to move between the FirstLine and SecondLine in EditMode (Time and Date).
     */
    else if(PosY==DAY_INDEX1&&PosX==SecondLine)
    {
        PosX=FirstLine;
        PosY=HOURS_INDEX1; /* Anas Edit This */
    }
    else
    {
        PosY--;
    }
    LCD_SetCursorPosAsynch(LCD1,PosX,PosY,NULL);
}

static void LCD_DisplayMainMenu(void)
{
    /* Display "Date and Time"    */
    LCD_SetCursorPosAsynch(LCD1,FirstLine,0,NULL);
    LCD_WriteStringAsynch(LCD1,"1.Date and Time",15,NULL);
    /* Display "Stopwatch"        */
    LCD_SetCursorPosAsynch(LCD1,SecondLine,0,NULL);
    LCD_WriteStringAsynch(LCD1,"2.Stopwatch",11,NULL);
    /* Return Cursor to Beginning */
    LCD_SetCursorPosAsynch(LCD1,FirstLine,0,NULL);
}

