anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchTensSeconds/10,NULL);
            ReturnError=LCD_WriteNumAsynch(LCD1,StopWatchTensSeconds%10,NULL);
        }
}
static void LCD_IncrementDateTime(void)
{
    /**************************************/
    /*      ___________________________   */
    /*     |                           |  */
    /*     |       08:27:40            |  */
    /*     |       HH:MM:SS            |  */
    /*     |___________________________|  */
    /*                                    */
    /**************************************/

/*----------------------------------------------------------------*/
/*-------------------------- Edit in Date ------------------------*/
/*----------------------------------------------------------------*/
    
    uint8_t DayIndex1  =(Day/10)       ;
    uint8_t DayIndex2  =(Day%10)       ;
    uint8_t MonthIndex1=(Month/10)     ;
    uint8_t MonthIndex2=(Month%10)     ;
    uint8_t YearIndex1 =Year/1000      ;  /* Thousands place */
    uint8_t YearIndex2 =(Year%1000)/100;  /* Hundreds place  */
    uint8_t YearIndex3 =(Year%100)/10  ;  /* Tens place      */
    uint8_t YearIndex4 =Year%10        ;  /* Ones place      */
    
    /*-------------------- Edit DayIndex1 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX1))
    {
        /* Ex: If Day is 30 or 31 and digit (3) triggered to Increment to be 4,5..(Not Allowed: Meaningless) */
        if(DayIndex1==3)
        {
            DayIndex1=0;
        }
         
        else 
        {
            DayIndex1++;
            /* CornerCase: If User Edit DayIndex2 Before DayIndex1 
             * Ex: Day = 31, and user increment DayIndex2 (1) to be 2,3,4....
             * DayIndex1 Must be Cleared (0) because Day: 32, 33,34 Not Allowed.
             *                                       Day: 02, 03,04
             */
            if((DayIndex1==3)&&(DayIndex2>1))
            {
                DayIndex2=0;
            }
        }
    }
    /*-------------------- Edit DayIndex2 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX2))
    {
        /**
         * If the Day is 31, and DayIndex2 triggered to increment (32,33), Meaningless.
         */
        if((DayIndex1==3)&&(DayIndex2==1)) 
        {
            DayIndex2=0;
        }
        if(DayIndex2==9)
        {
            DayIndex2=0;
        }
        else
        {
            DayIndex2++;
        }
    }
    /*---------------------- Edit MonthIndex1 -----------------*/
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX1))
    {
        if(MonthIndex1==1)
        {
            MonthIndex1=0;
        }
        else if(MonthIndex2<=2)  /* Months 10 - 11 - 12  Only */
        {
            MonthIndex1++;
        }
    }
    /*-------------------- Edit MonthIndex2 ------------------*/
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX2))
    {
        if(MonthIndex2==9)
        {
            MonthIndex2=0;
        }
        /*
         * Ex: Months: 10,11,12.. If MonthIndex2 Triggered to Increments to be 13,14...Meaningless.
         * So, MonthIndex2 must be cleared.
         */
        else if((MonthIndex2==2) &&(MonthIndex1==1))
        {
            MonthIndex2=0;            
        }
        else
        {
            MonthIndex2++;
        }
    }

    /*---------------------------------------------------------------*/
    /*------- Don't Edit in YearIndex1, YearIndex2  Meaningless -----*/
    /*---------------------------------------------------------------*/

    /*------------------- Edit YearIndex3 ---------------------*/
    if((PosX==SecondLine)&&(PosY==YEAR_INDEX3))
    {
        if(YearIndex3==9)
        {
            YearIndex3=0;
        }
        else
        {
            YearIndex3++;
        }
    }
    /*------------------- Edit YearIndex4 ---------------------*/
     if((PosX==SecondLine)&&(PosY==YEAR_INDEX4))
    {
        if(YearIndex4==9)
        {
            YearIndex4=0;
        }
        else
        {
            YearIndex4++;
        }
    }

/*======================= Date Updated Values =========================*/
    Day  =((DayIndex1*10)+DayIndex2);
    Month=((MonthIndex1*10)+MonthIndex2);
    Year =((YearIndex1*1000)+(YearIndex2*100)+(YearIndex3*10)+(YearIndex4));
/*=====================================================================*/
    
/*----------------------------------------------------------------*/
/*-------------------------- Edit in Time ------------------------*/
/*----------------------------------------------------------------*/
    uint8_t TimeHoursIndex1  = (TimeHours/10)  ;
    uint8_t TimeHoursIndex2  = (TimeHours%10)  ;
    uint8_t TimeMinutesIndex1= (TimeMinutes/10);
    uint8_t TimeMinutesIndex2= (TimeMinutes%10);  
    uint8_t TimeSecondsIndex1= (TimeSeconds/10);
    uint8_t TimeSecondsIndex2= (TimeSeconds%10);  

    /*Cursor Hour Index1*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX1)
    {
        /*Condition to Not Exceed Hours=23*/
        if((TimeHoursIndex1==1)&&(TimeHoursIndex2>3))
        {
            //Do Nothing
        }
        else if(TimeHoursIndex1==2)
        {
            TimeHoursIndex1=0;
        }
        else
        {
            TimeHoursIndex1++;
        }
    }

    /*Cursor Hour Index2*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX2)
    {
        if(TimeHoursIndex1==2&&TimeHoursIndex2==3)
        {
            TimeHoursIndex2=0;
        }
        else
        {
            if(TimeHoursIndex2==9)
            {
                TimeHoursIndex2=0;
            }
            else
            {
                TimeHoursIndex2++;
            }
        }

    }
    /*Cursor Minute Index1*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX1)
    {
        if(TimeMinutesIndex1==5)
        {
            TimeMinutesIndex1=0;
        }
        else
        {
            TimeMinutesIndex1++;
        }
    }
    /*Cursor Minute Index2*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX2)
    {
        if(TimeMinutesIndex2==9)
        {
            TimeMinutesIndex2=0;
        }
        else
        {
            TimeMinutesIndex2++;
        }
    }

    /*Cursor Seconds Index1*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX1)
    {
        if(TimeSecondsIndex1==5)
        {
            TimeSecondsIndex1=0;
        }
        else
        {
            TimeSecondsIndex1++;
        }
    }
    /*Cursor Seconds Index2*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX2)
    {
        if(TimeSecondsIndex2==9)
        {
            TimeSecondsIndex2=0;
        }
        else
        {
            TimeSecondsIndex2++;
        }
    }

