anaskhamees/Stm32F01CC_Drivers/src/APP/APP10_Demo1/Time_DateApp.c
    TimeHours= (TimeHoursIndex1*10)+TimeHoursIndex2;
    TimeMinutes= (TimeMinutesIndex1*10)+TimeMinutesIndex2;
    TimeSeconds= (TimeSecondsIndex1*10)+TimeSecondsIndex2;
    EditUpdate=MODIFIED;
}

static void LCD_DecrementDateTime(void)
{
/*-------------------------- Date ------------------------*/
    uint8_t DayIndex1  =(Day/10)       ;
    uint8_t DayIndex2  =(Day%10)       ;
    uint8_t MonthIndex1=(Month/10)     ;
    uint8_t MonthIndex2=(Month%10)     ;
    uint8_t YearIndex1 =Year/1000      ;  /* Thousands place */
    uint8_t YearIndex2 =(Year%1000)/100;  /* Hundreds place  */
    uint8_t YearIndex3 =(Year%100)/10  ;  /* Tens place      */
    uint8_t YearIndex4 =Year%10        ;  /* Ones place      */
    
    /*-------------------- Edit DayIndex1 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX1))
    {
        /**
         * IF Day is 01, and DayIndex1 (0) triggered to decrement,
         * The DayIndex1 will Be 3, So the day Will be 31. 
         */
        if((DayIndex1==0)&&(DayIndex2<2))
        {
            DayIndex1=3;
        }
        else
        {
            DayIndex1--;
        }
    }
    /*-------------------- Edit DayIndex2 -------------------*/
    if((PosX== SecondLine)&&(PosY==DAY_INDEX2))
    {
        /* Ex: If Day is 10 or 20, and DayIndex2(0) triggered to Decrement, 
         * DayIndex2 will be 9 ,Day 10 ---> Day 19 and Day 20 -----> 29.
         */
        if((DayIndex2==0)&&(DayIndex1<3))
        {
            DayIndex2=9;
        }
        /* Ex: If Day is 30 , and DayIndex2(0) triggered to Decrement, 
         * DayIndex2 will be 1 ,Day 30 ---> 31.
         */
        else if((DayIndex2==0)&&(DayIndex1==3))
        {
            DayIndex2=1;
        }
        else
        {
            DayIndex2--;
        }
    }
    /*---------------------- Edit MonthIndex1 -------------------*/
   
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX1))
    {
        /* Ex: If Month :01 or 02, and MonthIndex1 triggered to decrement
         * MonthIndex1 will be 1.... 01 ---> 11 / 02 ---> 12.
         */
        if((MonthIndex1==0)&&(MonthIndex2<3))
        {
            MonthIndex1=1;
        }
        /* Ex: If Month :03,04,05..... and MonthIndex1 triggered to decrement
         * MonthIndex1 will be 0 .... 03 ---> 03 / 04 ---> 04 .
         * Because Month 13, 14, 15 ... Not Allowed.
         */
        if((MonthIndex1==0)&&(MonthIndex2>=3))
        {
            MonthIndex1=0;
        }
        else 
        {
            MonthIndex1--;
        }
    }
    /*-------------------- Edit MonthIndex2 ------------------*/
    if((PosX==SecondLine)&&(PosY==MONTH_INDEX2))
    {
        /* Ex: If Month is 01 and MonthIndex1 triggered to decrement
         * Month will be 00 (Not Allowed), if triggered to decrement again.
         * MonthIndex2 will be 9... 00 -----> 09
         */
        if((MonthIndex1==0)&&(MonthIndex2==0))
        {
            MonthIndex2=9;
        }
        /**
         * Ex : If Month is 10 and  MonthIndex2 triggered to decrement 
         * MonthIndex2 will be 2,,,, 10 -----> 12
         */
        else if((MonthIndex2==0)&&(MonthIndex1==1))
        {
            MonthIndex2=2; /*Month 12*/
        }
        else
        {
            MonthIndex2--;
        }
    }

    /*------- Don't Edit in YearIndex1, YearIndex2  Meaningless -----*/
    /*------------------- Edit YearIndex3 ---------------------*/
    if((PosX==SecondLine)&&(PosY==YEAR_INDEX3))
    {
        if(YearIndex3==0)
        {
            YearIndex3=9;
        }
        else
        {
            YearIndex3--;
        }
    }
    /*------------------- Edit YearIndex4 ---------------------*/
     if((PosX==SecondLine)&&(PosY==YEAR_INDEX4))
    {
        if(YearIndex4==0)
        {
            YearIndex4=9;
        }
        else
        {
            YearIndex4--;
        }
    }

/*============================ Date Updated Values ===================================*/
    Day  =((DayIndex1*10)+DayIndex2);
    Month=((MonthIndex1*10)+MonthIndex2);
    Year =((YearIndex1*1000)+(YearIndex2*100)+(YearIndex3*10)+(YearIndex4));
/*====================================================================================*/
    /*-------------------------- Time ------------------------*/
    uint8_t TimeHoursIndex1  = (TimeHours/10)  ;
    uint8_t TimeHoursIndex2  = (TimeHours%10)  ;
    uint8_t TimeMinutesIndex1= (TimeMinutes/10);
    uint8_t TimeMinutesIndex2= (TimeMinutes%10);  
    uint8_t TimeSecondsIndex1= (TimeSeconds/10);
    uint8_t TimeSecondsIndex2= (TimeSeconds%10);  
    /*Cursor Hour Index1*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX1)
    {
        /*Condition to Not Exceed Hours=23*/
        if((TimeHoursIndex1==0)&&(TimeHoursIndex2>3))
        {
            //Do Nothing
        }
        else if(TimeHoursIndex1==0)
        {
            TimeHoursIndex1=2;
        }
        else
        {
            TimeHoursIndex1--;
        }
        
    }
    /*Cursor Hour Index2*/
    if(PosX==FirstLine&&PosY==HOURS_INDEX2)
    {
        if(TimeHoursIndex1==2&&TimeHoursIndex2==0)
        {
            TimeHoursIndex2=3;
        }
        else
        {
            if(TimeHoursIndex2==0)
            {
                TimeHoursIndex2=9;
            }
            else
            {
                TimeHoursIndex2--;
            }
        }

    }
    /*Cursor Minute Index1*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX1)
    {
        if(TimeMinutesIndex1==0)
        {
            TimeMinutesIndex1=5;
        }
        else
        {
            TimeMinutesIndex1--;
        }
    }
    /*Cursor Minute Index2*/
    if(PosX==FirstLine&&PosY==MINUTES_INDEX2)
    {
        if(TimeMinutesIndex2==0)
        {
            TimeMinutesIndex2=9;
        }
        else
        {
            TimeMinutesIndex2--;
        }
    }

    /*Cursor Seconds Index1*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX1)
    {
        if(TimeSecondsIndex1==0)
        {
            TimeSecondsIndex1=5;
        }
        else
        {
            TimeSecondsIndex1--;
        }
    }
    /*Cursor Seconds Index2*/
    if(PosX==FirstLine&&PosY==SECONDS_INDEX2)
    {
        if(TimeSecondsIndex2==0)
        {
            TimeSecondsIndex2=9;
        }
        else
        {
            TimeSecondsIndex2--;
        }
    }

